{
    "logs": [
        {
            "type": "Update",
            "title": "Minor Fixes / Visual Improvements / User Login Implementation",
            "details": [
                {
                    "p": "Added Resume to home page including links to github repository and linkedin account. Fixed issues with logs displaying on log page. Refined store page to view objects in cart properly. Begun work on user logins starting with Postgresql database API. Added to .env file for db login and created dbConfig.js to connect."
                }
            ],
            "date": "5/26/2020"
        },

        {
            "type": "Patch",
            "title": "HTML/JS/Stripe Security Patches",
            "details": [
                {
                    "p": "Patch 1: Issue: Changing html on public website front end would reduce actual item price. Solution: Changed javascript to access pricing data from secure, non-public JSON file so users cannot change html on webpage to fake price."
                },
                {
                    "p": "Patch 2: Issue: Needed a way to charge buyers through online credit transactions without leaking sensitive credit card information. Solution: Implemented Stripe Security features with encrypted public and private keys to follow PCI compliance."
                },
                {                        
                    "p": "Patch 3: Issue: All website backend data (Including Stripe private key) was exposed and available to the public through inspecting or github repository. Solution: Implemented .gitignore file with .env listing to hide private backend information."
                }
            ],
            "date": "5/25/2020"
        },

        {
            "type": "Update",
            "title": "Finished Webstore Stripe API Connection",
            "details": [
                {
                    "p": "Implemented Stripe API within the webstore. Implemented Stripe demo secret key and public key to send information to stripe for payment. Payment goes through to Stripe successfully using dummy information."
                }
            ],
            "date": "5/25/2020"
        },

        {
            "type": "Commit",
            "title": "Initial Commit",
            "details": [
                {
                    "p": "Initial Commit to Git. Commit contains 3 webpages: home page, store page, and log page. Store can display items stored in JSON file and add them to cart, however purchasing is not available. Log page allows log entries to be added to the page from a JSON file."
                }
            ],
            "date": "5/25/2020"
        }
    ]
}